---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotMaintainKeyReference
source: html/e75341b0-12ae-7394-9ae9-c67e30b9ea52.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotMaintainKeyReference Property

Can't maintain the position of the Location Line in this Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMaintainKeyReference { get; }
```